src/InformationRegisters/ПротоколСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПротоколСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийПротокола</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МоментВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыСобытийПротокола.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыСобытийПротокола</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ПротоколСобытий/Ext/ManagerModule.bsl
// Добавляет событие в протокол событий
//
// Параметры:
//  Описание	 - Строка	 - Описание события;
//  ТипСобытия	 - Строка	 - Тип события.
// 
// Возвращаемое значение:
//  Число - Момент времени записи события по объекту.
//
Функция Добавить(Событие, Описание, ТипСобытия) Экспорт

	МенеджерЗаписиРегистра = РегистрыСведений.ПротоколСобытий.СоздатьМенеджерЗаписи();

	МенеджерЗаписиРегистра.Период        = ТекущаяДата();
	МенеджерЗаписиРегистра.МоментВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	МенеджерЗаписиРегистра.ТипСобытия    = ТипСобытия;
	МенеджерЗаписиРегистра.Описание      = СокрЛП(Описание);
	МенеджерЗаписиРегистра.Событие       = СокрЛП(Событие);  

	МенеджерЗаписиРегистра.Записать();

	Возврат МенеджерЗаписиРегистра.МоментВремени;

КонецФункции

// Добавляет событие типа Информация в протокол событий
//
// Параметры:
//  Описание - Строка - Текст ошибки.
// 
// Возвращаемое значение:
//  Число - Момент времени записи предупреждения.
//
Функция ДобавитьИнформацию(Событие, Описание) Экспорт

	Возврат Добавить(Событие, Описание, Перечисления.ТипыСобытийПротокола.Информация);

КонецФункции

// Добавляет событие типа Предупреждение в протокол событий
//
// Параметры:
//  Описание - Строка - Текст ошибки.
// 
// Возвращаемое значение:
//  Число - Момент времени записи предупреждения.
//
Функция ДобавитьПредупреждение(Событие,Описание) Экспорт

	Возврат Добавить(Событие, Описание, Перечисления.ТипыСобытийПротокола.Предупреждение);

КонецФункции

// Добавляет событие типа Ошибка в протокол событий
//
// Параметры:
//  Описание - Строка - Текст ошибки.
// 
// Возвращаемое значение:
//  Число - Момент времени записи сообщения об ошибке.
//
Функция ДобавитьОшибку(Событие, Описание) Экспорт

	Возврат Добавить(Событие, Описание, Перечисления.ТипыСобытийПротокола.Ошибка);

КонецФункции
